{
    "attributes": [
        {
            "description": "Identifier of the system which handled the information item. This is the IT system owned by the organisation legally responsible for handling the data, and at which the data were previously created or passed by an earlier system.",
            "multiplicity": "1..1",
            "name": "system_id",
            "type": "String"
        },
        {
            "description": "Identifier of the particular site/facility within an organisation which handled the item. For computability, this identifier needs to be e.g. a PKI identifier which can be included in the identifier list of the `PARTY_IDENTIFIED` object.",
            "multiplicity": "0..1",
            "name": "location",
            "type": "PARTY_IDENTIFIED"
        },
        {
            "description": "Identifiers for subject of the received information item.",
            "multiplicity": "0..1",
            "name": "subject",
            "type": "PARTY_PROXY"
        },
        {
            "description": "Optional provider(s) who created, committed, forwarded or otherwise handled the item.",
            "multiplicity": "0..1",
            "name": "provider",
            "type": "PARTY_IDENTIFIED"
        },
        {
            "description": "Time of handling the item. For an originating system, this will be time of creation, for an intermediate feeder system, this will be a time of accession or other time of handling, where available.",
            "multiplicity": "0..1",
            "name": "time",
            "type": "DV_DATE_TIME"
        },
        {
            "description": "Any identifier used in the system such as  \"interim\" ,  \"final\" , or numeric versions if available.",
            "multiplicity": "0..1",
            "name": "version_id",
            "type": "String"
        },
        {
            "description": "Optional attribute to carry any custom meta-data. May be archetyped.",
            "multiplicity": "0..1",
            "name": "other_details",
            "type": "ITEM_STRUCTURE"
        }
    ],
    "constants": [],
    "functions": [],
    "meta_info": {
        "base_types": null,
        "classifier": "Class",
        "description": "Audit details for any system in a feeder system chain. Audit details here means the general notion of who/where/when the information item to which the audit is attached was created. None of the attributes is defined as mandatory, however, in different scenarios, various combinations of attributes will usually be mandatory. This can be controlled by specifying feeder audit details in legacy archetypes.",
        "name": "FEEDER_AUDIT_DETAILS"
    }
}