{
    "attributes": [
        {
            "description": "Mandatory indicator of the localised language in which this Composition is written. Coded from openEHR Code Set  `languages`. The language of an Entry if different from the Composition is indicated in `ENTRY._language_`.",
            "multiplicity": "1..1",
            "name": "language",
            "type": "CODE_PHRASE"
        },
        {
            "description": "Name of territory in which this Composition was written. Coded from openEHR  countries  code set, which is an expression of the ISO 3166 standard.",
            "multiplicity": "1..1",
            "name": "territory",
            "type": "CODE_PHRASE"
        },
        {
            "description": "Temporal category of this Composition, i.e.",
            "multiplicity": "1..1",
            "name": "category",
            "type": "DV_CODED_TEXT"
        },
        {
            "description": "The clinical session context of this Composition, i.e. the contextual attributes of the clinical session.",
            "multiplicity": "0..1",
            "name": "context",
            "type": "EVENT_CONTEXT"
        },
        {
            "description": "The person primarily responsible for the content of the Composition (but not necessarily its committal into the EHR system). This is the identifier which should appear on the screen. It may or may not be the person who entered the data. When it is the patient, the special self  instance of `PARTY_PROXY` will be used.",
            "multiplicity": "1..1",
            "name": "composer",
            "type": "PARTY_PROXY"
        },
        {
            "description": "The content of this Composition.",
            "multiplicity": "0..1",
            "name": "content",
            "type": "List"
        }
    ],
    "constants": [],
    "functions": [
        {
            "meaning": "True if category is `431&#124;persistent&#124;`, False otherwise. Useful for finding Compositions in an EHR which are guaranteed to be of interest to most users.",
            "name": "is_persistent",
            "parameters": [],
            "return_type": "Boolean"
        }
    ],
    "meta_info": {
        "base_types": [
            "LOCATABLE"
        ],
        "classifier": "Class",
        "description": "Content of one version in a `VERSIONED_COMPOSITION`. A Composition is considered the unit of modification of the record, the unit of transmission in record Extracts, and the unit of attestation by authorising clinicians. In this latter sense, it may be considered equivalent to a signed document.",
        "name": "COMPOSITION"
    }
}