{
    "attributes": [
        {
            "description": "Start time of the clinical session or other kind of event during which a provider performs a service of any kind for the patient.",
            "multiplicity": "1..1",
            "name": "start_time",
            "type": "DV_DATE_TIME"
        },
        {
            "description": "Optional end time of the clinical session.",
            "multiplicity": "0..1",
            "name": "end_time",
            "type": "DV_DATE_TIME"
        },
        {
            "description": "The actual location where the session occurred, e.g. 'microbiology lab 2', 'home', 'ward A3'  and so on.",
            "multiplicity": "0..1",
            "name": "location",
            "type": "String"
        },
        {
            "description": "The setting in which the clinical session took place. Coded using the openEHR Terminology,  setting  group.",
            "multiplicity": "1..1",
            "name": "setting",
            "type": "DV_CODED_TEXT"
        },
        {
            "description": "Other optional context which will be archetyped.",
            "multiplicity": "0..1",
            "name": "other_context",
            "type": "ITEM_STRUCTURE"
        },
        {
            "description": "The health care facility under whose care the event took place. This is the most specific workgroup or delivery unit within a care delivery enterprise that has an official identifier in the health system, and can be used to ensure medico-legal accountability.",
            "multiplicity": "0..1",
            "name": "health_care_facility",
            "type": "PARTY_IDENTIFIED"
        },
        {
            "description": "Parties involved in the healthcare event. These would normally include the physician(s) and often the patient (but not the latter if the clinical session is a pathology test for example).",
            "multiplicity": "0..1",
            "name": "participations",
            "type": "List<PARTICIPATION>"
        }
    ],
    "constants": [],
    "functions": [],
    "meta_info": {
        "base_type": "PATHABLE",
        "classifier": "Class",
        "description": "Documents the context information of a healthcare event involving the subject of care and the health system. The context information recorded here are independent of the attributes recorded in the version audit, which document the  system interaction  context, i.e. the context of a user interacting with the health record system. Healthcare events include patient contacts, and any other business activity, such as pathology investigations which take place on behalf of the patient.",
        "name": "EVENT_CONTEXT"
    }
}