{
    "attributes": [
        {
            "description": "Displayable rendition of the item, regardless of its underlying structure. For `DV_CODED_TEXT`, this is the rubric of the complete term as provided by the terminology service.",
            "multiplicity": "1..1",
            "name": "value",
            "type": "String"
        },
        {
            "description": "DEPRECATED: this field is deprecated; use markdown link/text in the `_value_` attribute, and `\"markdown\"` as the value of the `_formatting_` field.",
            "multiplicity": "0..1",
            "name": "hyperlink",
            "type": "DV_URI"
        },
        {
            "description": "If set, contains one of the following values:",
            "multiplicity": "0..1",
            "name": "formatting",
            "type": "String"
        },
        {
            "description": "Terms from other terminologies most closely matching this term, typically used where the originator (e.g. pathology lab) of information uses a local terminology but also supplies one or more equivalents from well known terminologies (e.g. LOINC).",
            "multiplicity": "0..1",
            "name": "mappings",
            "type": "List<TERM_MAPPING>"
        },
        {
            "description": "Optional indicator of the localised language in which the value is written. Coded from openEHR Code Set  languages . Only used when either the text object is in a different language from the enclosing `ENTRY`, or else the text object is being used outside of an `ENTRY` or other enclosing structure which indicates the language.",
            "multiplicity": "0..1",
            "name": "language",
            "type": "CODE_PHRASE"
        },
        {
            "description": "Name of character encoding scheme in which this value is encoded. Coded from openEHR Code Set  character sets . Unicode is the default assumption in openEHR, with UTF-8 being the assumed encoding. This attribute allows for variations from these assumptions.",
            "multiplicity": "0..1",
            "name": "encoding",
            "type": "CODE_PHRASE"
        }
    ],
    "constants": [],
    "functions": [],
    "meta_info": {
        "base_types": [
            "DATA_VALUE"
        ],
        "classifier": "Class",
        "description": "A text item, which may contain any amount of legal characters arranged as e.g. words, sentences etc (i.e. one `DV_TEXT` may be more than one word). Visual formatting and hyperlinks may be included via markdown.",
        "name": "DV_TEXT"
    }
}